#include "speechManager.h"

/*

功能描述：
	提供菜单界面与用户交互
	对演讲比赛流程进行控制
	与文件的读写交互

*/

// 构造函数的实现
SpeechManager::SpeechManager()
{


}

//菜单功能
void SpeechManager::showMenu()
{
	cout << "**********************************************************************" << endl;
	cout << "**************************  欢迎参加演讲比赛  ************************" << endl;
	cout << "**************************   1.开始演讲比赛  *************************" << endl;
	cout << "**************************   2.查看往届记录  *************************" << endl;
	cout << "**************************   3.清空比赛记录  *************************" << endl;
	cout << "**************************   0.退出比赛程序  *************************" << endl;
	cout << "**********************************************************************" << endl;
	cout << endl;
}



//析构函数的实现
SpeechManager::~SpeechManager()
{


}